## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bs-co-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stbscomtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: benchspace-co.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stbscomtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.bs-uk-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stbsukmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: benchspace-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stbsukmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.maj-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stmajmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: mattandjen-co-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stmajmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.mjw-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stmjwmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: matthewjwhite-co-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stmjwmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.oa-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stoamtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: objectatelier-co-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stoamtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.swd-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stswdmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: simonwhitedesign-co-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://stswdmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.tlw-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://sttlwmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
          - version: STSv1
          + version: STSv1
          - mode: testing
          + mode: testing
            mx: tonyandlizwhite-co-uk.mail.protection.outlook.com
            max_age: 86400
        EOT
      ~ url                    = "https://sttlwmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```
</details>